Created topics using the latest released ES module:
```
> grep "terraform-ibm-event-streams" main.tf                                
  source            = "git::https://github.com/terraform-ibm-modules/terraform-ibm-event-streams.git?ref=v2.11.1"

> terraform init
Initializing the backend...
Initializing modules...
Initializing provider plugins...
- Reusing previous version of ibm-cloud/ibm from the dependency lock file
- Reusing previous version of hashicorp/time from the dependency lock file
- Using previously-installed ibm-cloud/ibm v1.72.0-beta0
- Using previously-installed hashicorp/time v0.12.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

> terraform plan
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 1s [id=<redacted>]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic[0] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "10485760"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "10485760"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic-1"
      + partitions           = 1
      + resource_instance_id = (known after apply)
    }

  # module.event_streams.ibm_event_streams_topic.es_topic[1] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "compact,delete"
          + "retention.bytes" = "1073741824"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "536870912"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic-2"
      + partitions           = 1
      + resource_instance_id = (known after apply)
    }

  # module.event_streams.ibm_resource_instance.es_instance will be created
  + resource "ibm_resource_instance" "es_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "us-south"
      + locked                  = (known after apply)
      + name                    = "test-es"
      + onetime_credentials     = (known after apply)
      + plan                    = "standard"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = "<redacted>"
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "messagehub"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)

      + timeouts {
          + create = "3h"
          + delete = "15m"
          + update = "1h"
        }
    }

  # module.event_streams.time_sleep.wait_for_authorization_policy will be created
  + resource "time_sleep" "wait_for_authorization_policy" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.

> terraform apply -auto-approve
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 1s [id=<redacted>]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic[0] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "10485760"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "10485760"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic-1"
      + partitions           = 1
      + resource_instance_id = (known after apply)
    }

  # module.event_streams.ibm_event_streams_topic.es_topic[1] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "compact,delete"
          + "retention.bytes" = "1073741824"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "536870912"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic-2"
      + partitions           = 1
      + resource_instance_id = (known after apply)
    }

  # module.event_streams.ibm_resource_instance.es_instance will be created
  + resource "ibm_resource_instance" "es_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "us-south"
      + locked                  = (known after apply)
      + name                    = "test-es"
      + onetime_credentials     = (known after apply)
      + plan                    = "standard"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = "<redacted>"
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "messagehub"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)

      + timeouts {
          + create = "3h"
          + delete = "15m"
          + update = "1h"
        }
    }

  # module.event_streams.time_sleep.wait_for_authorization_policy will be created
  + resource "time_sleep" "wait_for_authorization_policy" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.event_streams.time_sleep.wait_for_authorization_policy: Creating...
module.event_streams.ibm_resource_instance.es_instance: Creating...
module.event_streams.time_sleep.wait_for_authorization_policy: Still creating... [10s elapsed]
module.event_streams.ibm_resource_instance.es_instance: Still creating... [10s elapsed]
module.event_streams.ibm_resource_instance.es_instance: Creation complete after 16s [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::]
module.event_streams.ibm_event_streams_topic.es_topic[0]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic[1]: Creating...
module.event_streams.time_sleep.wait_for_authorization_policy: Still creating... [20s elapsed]
module.event_streams.ibm_event_streams_topic.es_topic[1]: Creation complete after 4s [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-2]
module.event_streams.ibm_event_streams_topic.es_topic[0]: Creation complete after 4s [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-1]
module.event_streams.time_sleep.wait_for_authorization_policy: Creation complete after 30s [id=2024-12-03T17:20:03Z]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

Upgrade the module version to the last commit in this PR:
```
> # Upgrade ES module version
> grep "terraform-ibm-event-streams" main.tf
  source            = "git::https://github.com/navidsh/terraform-ibm-event-streams.git?ref=pr-350"
```

Output of `terraform plan` prior to `move` commands:
```
> terraform init
Initializing the backend...
Initializing modules...
Downloading git::https://github.com/navidsh/terraform-ibm-event-streams.git?ref=pr-350 for event_streams...
- event_streams in .terraform/modules/event_streams
Downloading registry.terraform.io/terraform-ibm-modules/cbr/ibm 1.29.0 for event_streams.cbr_rule...
- event_streams.cbr_rule in .terraform/modules/event_streams.cbr_rule/modules/cbr-rule-module
Downloading registry.terraform.io/terraform-ibm-modules/common-utilities/ibm 1.1.0 for event_streams.es_guid_crn_parser...
- event_streams.es_guid_crn_parser in .terraform/modules/event_streams.es_guid_crn_parser/modules/crn-parser
Initializing provider plugins...
- Reusing previous version of ibm-cloud/ibm from the dependency lock file
- Reusing previous version of hashicorp/time from the dependency lock file
- Using previously-installed ibm-cloud/ibm v1.72.0-beta0
- Using previously-installed hashicorp/time v0.12.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

> terraform plan
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 1s [id=<redacted>]
module.event_streams.time_sleep.wait_for_authorization_policy: Refreshing state... [id=2024-12-03T17:20:03Z]
module.event_streams.ibm_resource_instance.es_instance: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::]
module.event_streams.ibm_event_streams_topic.es_topic[1]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-2]
module.event_streams.ibm_event_streams_topic.es_topic[0]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-1]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic[0] will be destroyed
  # (because resource does not use count)
  - resource "ibm_event_streams_topic" "es_topic" {
      - config               = {
          - "cleanup.policy"  = "delete"
          - "retention.bytes" = "10485760"
          - "retention.ms"    = "86400000"
          - "segment.bytes"   = "10485760"
        } -> null
      - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-1" -> null
      - kafka_brokers_sasl   = [
          - "broker-0-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-1-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-2-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-3-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-4-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-5-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
        ] -> null
      - kafka_http_url       = "https://brz6rjg5qkzr303g.svc01.us-south.eventstreams.cloud.ibm.com" -> null
      - name                 = "topic-1" -> null
      - partitions           = 1 -> null
      - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::" -> null
    }

  # module.event_streams.ibm_event_streams_topic.es_topic[1] will be destroyed
  # (because resource does not use count)
  - resource "ibm_event_streams_topic" "es_topic" {
      - config               = {
          - "cleanup.policy"  = "compact,delete"
          - "retention.bytes" = "1073741824"
          - "retention.ms"    = "86400000"
          - "segment.bytes"   = "536870912"
        } -> null
      - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-2" -> null
      - kafka_brokers_sasl   = [
          - "broker-0-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-1-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-2-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-3-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-4-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-5-brz6rjg5qkzr303g.kafka.svc01.us-south.eventstreams.cloud.ibm.com:9093",
        ] -> null
      - kafka_http_url       = "https://brz6rjg5qkzr303g.svc01.us-south.eventstreams.cloud.ibm.com" -> null
      - name                 = "topic-2" -> null
      - partitions           = 1 -> null
      - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::" -> null
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic-1"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "10485760"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "10485760"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic-1"
      + partitions           = 1
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::"
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic-2"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "compact,delete"
          + "retention.bytes" = "1073741824"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "536870912"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic-2"
      + partitions           = 1
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

Output of `terraform state mv` commands:
```
> terraform state mv 'module.event_streams.ibm_event_streams_topic.es_topic[0]' 'module.event_streams.ibm_event_streams_topic.es_topic["topic-1"]'
Move "module.event_streams.ibm_event_streams_topic.es_topic[0]" to "module.event_streams.ibm_event_streams_topic.es_topic[\"topic-1\"]"
Successfully moved 1 object(s).

> terraform state mv 'module.event_streams.ibm_event_streams_topic.es_topic[1]' 'module.event_streams.ibm_event_streams_topic.es_topic["topic-2"]'
Move "module.event_streams.ibm_event_streams_topic.es_topic[1]" to "module.event_streams.ibm_event_streams_topic.es_topic[\"topic-2\"]"
Successfully moved 1 object(s).
```

Output of `terraform plan` after moving resources:
```
> terraform plan
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 2s [id=<redacted>]
module.event_streams.time_sleep.wait_for_authorization_policy: Refreshing state... [id=2024-12-03T17:20:03Z]
module.event_streams.ibm_resource_instance.es_instance: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545::]
module.event_streams.ibm_event_streams_topic.es_topic["topic-1"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-1]
module.event_streams.ibm_event_streams_topic.es_topic["topic-2"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/<redacted>:b4689120-6450-45fe-b224-0d49e0293545:topic:topic-2]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```